usr.sbin/hwc/hwc.8
.\"-
.\" Copyright (c) 2026 Ruslan Bukin <br@FreeBSD.org>
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd May 5, 2025
.Dt HWC 8
.Os
.Sh NAME
.Nm hwc
.Nd Instrumentation tool for hardware counters.
.Sh SYNOPSIS
.Op Fl cfh
.Op Fl c Ar backend name
.Op Fl f Ar config
.Op Fl h
.Op Ar path to executable
.Sh DESCRIPTION
The
.Nm
uses kernel facilities provided by the
.Xr hwc 4
framework to launch and count events occuired during runtime of an executable
specified by
.Pa path
.Pp
The options are as follows:
.Bl -tag -width "event_payload"
.It Fl c Ar name
Optional. Name of the tracing backend to be used.
Currently supported tracing backends are:
.Pp
.Bl -bullet -compact
.It
pmu (riscv)
.El
.Pp
.Nm
will select the first available backend if the flag is not present.
.It Fl f Ar config
Configuration file.
.It Fl h
Usage information.
.El
.Sh EXIT STATUS
.Ex -std
.Sh EXAMPLES
Count events occured during execution of a program:
.Pp
.Dl "hwc -f hwc-x730 /usr/bin/uname"
.Sh SEE ALSO
.Xr hwc 4
.Sh HISTORY
The
.Nm
utility first appeared in
.Fx 16.0 .
.Sh AUTHORS
.An Ruslan Bukin Aq Mt br@FreeBSD.org
